# номер 2
x=int(input('Введите скорость (в метрах в секунду): '))
y=int(input('Введите время (в секундах): '))
print('Пройденное растояние = ', x*y)



# номер 4
import math


h=int(input('Введите высоту (в метрах): '))
print(round(math.sqrt(2*h/9.8),2))



# номер 5
a = int(input("Введите a: "))
b = int(input("Введите b: "))
c = int(input("Введите c: "))
print(round((a+b+c)/3,2))



# номер 8
m=int(input('Введите массу (в килограммах): '))
v=int(input('Введите скорость (в метрах в секунду): '))
print('E = ', round(0.5*m*v**2,2))